; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image3 - mode
	thermograph4 - mode
	infrared2 - mode
	image5 - mode
	spectrograph6 - mode
	infrared0 - mode
	spectrograph1 - mode
	GroundStation0 - direction
	Star1 - direction
	Star2 - direction
	Star3 - direction
	GroundStation4 - direction
	Star5 - direction
	Star6 - direction
	Star8 - direction
	GroundStation10 - direction
	Star9 - direction
	GroundStation7 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 spectrograph6)
	(supports instrument0 spectrograph1)
	(supports instrument0 infrared0)
	(supports instrument0 image5)
	(supports instrument0 thermograph4)
	(supports instrument0 image3)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 Star9)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon12)
)
(:goal (and
	(have_image Star11 infrared2)
	(have_image Star11 image3)
	(have_image Phenomenon12 image5)
	(have_image Phenomenon12 image3)
	(have_image Phenomenon13 spectrograph1)
	(have_image Phenomenon13 spectrograph6)
	(have_image Star14 thermograph4)
	(have_image Star14 infrared2)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 8
2. (turn_to satellite0 star9 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star9)
   goals met: 0 of 8
3. (calibrate satellite0 instrument0 star9)
   added: (calibrated instrument0)
   goals met: 0 of 8
4. (turn_to satellite0 phenomenon12 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 phenomenon12)
   goals met: 0 of 8
5. (take_image satellite0 phenomenon12 instrument0 image3)
   added: (have_image phenomenon12 image3)
   goals met: 1 of 8
6. (take_image satellite0 phenomenon12 instrument0 image5)
   added: (have_image phenomenon12 image5)
   goals met: 2 of 8
7. (turn_to satellite0 phenomenon13 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon13)
   goals met: 2 of 8
8. (take_image satellite0 phenomenon13 instrument0 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 3 of 8
9. (take_image satellite0 phenomenon13 instrument0 spectrograph6)
   added: (have_image phenomenon13 spectrograph6)
   goals met: 4 of 8
10. (turn_to satellite0 star11 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star11)
   goals met: 4 of 8
11. (take_image satellite0 star11 instrument0 image3)
   added: (have_image star11 image3)
   goals met: 5 of 8
12. (take_image satellite0 star11 instrument0 infrared2)
   added: (have_image star11 infrared2)
   goals met: 6 of 8
13. (turn_to satellite0 star14 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star14)
   goals met: 6 of 8
14. (take_image satellite0 star14 instrument0 infrared2)
   added: (have_image star14 infrared2)
   goals met: 7 of 8
15. (take_image satellite0 star14 instrument0 thermograph4)
   added: (have_image star14 thermograph4)
   goals met: 8 of 8
